app/controllers/playlists_controller.rb

  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save
---
INSERT INTO "playlists" ("name", "access_code", "songs_per_user", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test a token"], ["access_code", "123"], ["songs_per_user", 5], ["created_at", 2016-07-20 03:11:56 UTC], ["updated_at", 2016-07-20 03:11:56 UTC]]

  def update
    if @playlist.update(playlist_params)
---
UPDATE "playlists" SET "access_token" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3

    def set_playlist
      @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]