app/controllers/songs_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @playlist = Playlist.find(params[:playlist_id])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
      @playlist = Playlist.find(params[:playlist_id])
      @song = Song.find(params[:id])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "songs" ("user", "playlist_id", "title", "artist", "album", "album_art", "duration", "audio_url", "uri", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @playlist = Playlist.find(params[:playlist_id])
    @song = @playlist.songs.build(song_params)

    if @song.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "songs" SET "score" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["score", "1"], ["updated_at", 2016-07-19 16:57:06 UTC], ["id", 11]]
---
  def update
        @playlist = Playlist.find(params[:playlist_id])
        @song = Song.find(params[:id])
        if @song.update(song_params)